add mermaid graph
